# Shell
cask "kitty"
brew "autojump"
brew "vivid"
brew "direnv"
brew "asdf"
brew "less"
brew "httpie"
brew "jq"
brew "eza"
brew "fd"
brew "git-delta"
brew "zoxide"
brew "tmux"

cask "1password-cli"

# general dev
brew "neovim"
brew "ruby-install"
brew "chruby"
brew "gpg"
cask "gpg-suite"

brew "vint"
brew "shellcheck"
brew "fzf"
brew "node"

tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ['HEAD']

# wm
cask "nikitabobko/tap/aerospace"


# General apps
cask "zoom"
