# Shell
cask "kitty"
brew "autojump"
brew "vivid"
brew "direnv"
brew "asdf"
brew "coreutils" # For gls
brew "httpie"
brew "jq"
brew "exa"
brew "fd"

cask "1password-cli"

# general dev
brew "neovim"
brew "qcachegrind"
tap "LouisBrunner/valgrind"
brew "valgrind", args: ['HEAD']
brew "rust-analyzer"
brew "ccls"
brew "ninja"
brew "hyperfine"
brew "lsusb"
brew "ruby-install"
brew "chruby"
brew "gpg"
cask "gpg-suite"

brew "vint"
brew "shellcheck"

tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ['HEAD']

# lichess stack
brew "sbt"
brew "scalacenter/bloop/bloop"

# wm
brew "yabai"
brew "skhd"


# General apps
cask "signal"
