# Shell
cask "kitty"
brew "autojump"
brew "vivid"
brew "direnv"
brew "asdf"
brew "coreutils" # For gls
brew "less"
brew "httpie"
brew "jq"
brew "exa"
brew "fd"
brew "git-delta"
brew "zoxide"

cask "1password-cli"
cask "slack-cli"

# general dev
brew "neovim"
brew "qcachegrind"
tap "LouisBrunner/valgrind"
brew "valgrind", args: ['HEAD']
brew "rust-analyzer"
brew "ccls"
brew "ninja"
brew "hyperfine"
brew "lsusb"
brew "ruby-install"
brew "chruby"
brew "gpg"
cask "gpg-suite"
cask "ngrok"
tap "probe-rs/probe-rs"
brew "probe-rs"

brew "vint"
brew "shellcheck"

tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ['HEAD']

# wm
brew "yabai"
brew "skhd"


# General apps
cask "signal"
cask "blender"
cask "zoom"

cask "prusaslicer"
cask "superslicer"
cask "orcaslicer"

# Cross compile for raspberry pi and rust
brew "arm-linux-gnueabihf-binutils"

# micro:bit support for rust
tap "ArmMbed/homebrew-formulae"
brew "arm-none-eabi-gcc"
brew "minicom"

# For embedded graphics simulator
brew "sdl2"

# Kids dev
brew "python-tk"

# FRC 2024
brew "openjdk@17"
